app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
	def index
		@recipes = Recipe.all.reverse

SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = ? LIMIT 1  [["id", 0]]
---
	def show
		@recipe = Recipe.find params[:id]

INSERT INTO "recipes" ("created_at", "description", "directions", "ingredients", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-03-29 17:42:58.127667"], ["description", ""], ["directions", ""], ["ingredients", ""], ["title", ""], ["updated_at", "2015-03-29 17:42:58.127667"]]
---
	def create
		@new_recipe = Recipe.create(params_recipe)